Repository: Harvindersingh0114/mss-doc
Catalog: docs/source/locale/*/LC_MESSAGES/02-Network.po
Languages: gu, hi

source: Network Configuration
gu: નેટવર્ક વ્યવસ્થાપક
hi: नेटवर्क कॉन्फ़िगरेशन

source: Via Network Manager
gu: નેટવર્ક મેનેગેર દ્વારા
hi: नेटवर्क मेनेजर द्वारा

source: MSS comes with 2 predefined network configurations: Static and Dynamic.
gu: MSS 2 પૂર્વવ્યાખ્યાયિત નેટવર્ક કન્ફિગરેશન્સ સાથે આવે છે: સ્ટેટિક અને ડાયનેમિક.
hi: MSS दो पूर्व-परिभाषित नेटवर्क कॉन्फ़िगरेशन के साथ आता है : स्थैतिक और डायनामिक.

source: If your network already has a DHCP server serving IP address to devices connected on your LAN then you need to configure the MSS in Dynamic mode. If no such DHCP server exists, then configure the MSS in Static mode.
gu: જો તમારા નેટવર્કમાં dhcp સર્વર હોય જે તમારા ઉપકરણનો ને IP એડ્રેસ આપતું હોય તો MSS ને ડાયનામિક મોડેમાં કોન્ફીગર કરો. જો DHCP સર્વર ના હોય તો MSS ને સ્ટેટિક મોડેમાં કોન્ફીગર કરો.
hi: यदि आपके नेटवर्क मे पहले से ही DHCP सर्वर है जो आपके लैन से जुड़े उपकरणो को आईपी एड्रेस प्रदान करता है फिर आपको MSS को डायनामिक मोड मे कोन्फ़िगर करना होगा. यदि ऐसा कोई DHCP सर्वर नहीं है तो MSS को स्थैतिक मोड मे कोन्फ़िगर करना होगा.

source: It is safe to assume that in majority of cases where a new network has just been setup for the purpose of installing the MSS, there is no pre-existing DHCP server, hence one may safely opt for Static mode.
gu: મોટાભાગના કેસોમાં જ્યાં નવું નેટવર્ક ફક્ત MSS ની સ્થાપના કરવા માટે તૈયાર કરવામાં આવ્યું છે, ત્યાં લગભગ DHCP સર્વર હોવાની સંભાવના ઓછી છે, તેથી કોઈ સ્ટેટિક મોડ પસંદ કરી શકે છે.
hi: यह मन लेना सुरक्षित होगा के अधिकतर जगहो मे जहां नया नेटवर्क बस सेट उप ही किया गया है MSS इन्स्टाल करने के उद्देश्य से, वहाँ पहले से कोई DHCP सर्वर मौजूद नहीं होगा, इसलिए कोई भी सुरक्षित रूप से स्टेटिक मोड का विकल्प चुन सकता है.

source: Herein are the details of how to configure in Static or Dynamic mode:
gu: અહીં સ્ટેટિક અથવા ડાયનેમિક મોડમાં કોન્ફીગર કરવાની વિગતો છે:
hi: यहाँ इसकी विगत दी हुई है के स्थैतिक अथवा डायनामिक विकल्प मे कैसे कॉन्फ़िगर करे:

source: After login, edit the connection that would not be used and uncheck “Automatically connect to this network when it is available” to disable auto-connection attempts in the undesired mode. For example, herein below, we are *disabling ‘Dynamic’ and enabling ‘Static’ mode*.
gu: લોગીન થયા પછી, જે મોડ ના વાપરતા હો તેની સેટિંગમાં “Automatically connect to this network when it is available” અનચેક કરો. આનાથી જે મોડ ના વાપરવાનો હોય તે નિષ્ક્રિય થશે. ઉદાહરણ તરીકે, નીચે બતાવેલ પ્રમાણે, અમે 'ડાયનેમિક' ને નિષ્ક્રિય કરી રહ્યા છીએ અને 'સ્ટેટિક' મોડને સક્રિય કરી રહ્યા છીએ.
hi: लॉगिन करने के पश्चात, वह कनेकशन एडिट करे जिसका उपयोग नही होगा और “उपलब्ध होने पर इस नेटवर्क से स्वचालित रूप से कनेक्ट करें” को अनचेक करे अवांछित मोड में स्वत: कनेक्शन के प्रयास को अक्षम करने के लिए. उदाहरण के लिए, यहाँ नीचे, हम डायनामिक को अक्षम करके और स्थैतिक को सक्रिय करते है.

source: **Network Manager - Edit Connections**
hi: **नेटवर्क मेनेजर – कनेक्शन का संपादन**

source: **Network Connections**
gu: **નેટવર્ક વ્યવસ્થાપક (Network Manager)**
hi: **नेटवर्क कनेक्शंस**

source: **Uncheck to switch off dynamic mode**
gu: **ડાયનેમિક મોડને નિષ્ક્રિય કરવા માટે અનચેક કરો**
hi: **डायनामिक मोड को बंद करने के लिए सही का निशान हटाएँ**

source: **Check to switch on static mode**
gu: **સ્ટેટિક મોડને સક્રિય કરવા માટે ચેક કરો**
hi: **स्थैतिक मोड पर स्विच करने के लिए चेक करें**

source: Finally, choose “static” in the Network Manager menu and your MSS is now operating in static mode.
gu: છેલ્લે, "નેટવર્ક વ્યવસ્થાપક" મેનૂમાં "સ્ટેટિક" પસંદ કરો અને તમારું MSS હવે સ્ટેટિક મોડમાં કાર્યરત થશે.
hi: अंततः, नेटवर्क मेनेजर मेनू मे “स्थैतिक” को चुने और अब आपका MSS स्थैतिक मोड मे कार्यरत है.
